/* アプリケーション共通定数定義 */
module.exports ={
    /* ログ定義 */
    'log':{
        'all': 'debug',
        'sys': 'system',
        'command': 'command'
    },

    /* DiscordID */
    'discord_server':{
        'client': '1010931290905780275',    // BOT自身のID
        'guild': '999224023785422879',      // 使用するサーバー
        'chnanel':{
            'schedule': '1102244278018773032',  // 凸先アンケ
            'post': '1060606374133895250',      // ボス情報を投稿するチャンネル
            'vote': '1060606192960946207',      // 参加募集をするチャンネル
            'report': '1061228717365526560',    // 凸情報を記録するチャンネル
            'command': '1061228769458794586'    // コマンド実行を許容するチャンネル
        },

        // 固定で使用するメッセージのID
        'message':{
            // 各ボスの参加リアクションをもらうメッセージ
            'vote1': '1079014494451290163',
            'vote2': '1079014513380175932',
            'vote3': '1079014528718733402',
            'vote4': '1079014539988848650',
            'vote5': '1079014549413433506',
            'manage1': '1061245948694626385',
            'manage2': '1061245950540132373',
            'manage3': '1061245952167518309',
            'manage4': '1061245953702629457',
            'manage5': '1061245954935758930',
            'schedule1': '1104486329561120769',
            'schedule2': '1104486332346146836',
            'schedule3': '1104486335441539233',
            'schedule4': '1104486337060544613',
            'schedule5': '1104486338859913217'
        }
    }
}
